# Задача:
**В мобильное приложение требуется добавить 
возможность, чтобы каждый пользователь мог указать 
свои паспортные данные, которые должны проверяться по ИНН, корректные данные должны отправляться в базу данных о пользователе. Также у пользователя должна быть возмоижность удалять паспортные данные через службу поддержки.**
##
1. (UI) Создание кнопки "Добавления паспортных данных" для пользователя в его личном кабинете. Данная кнопка должна переадресовывать на страницу для ввода паспортных данных(Пункт №2).
##
2. (UI) Создание страницы с использованием `API ФНС(innfl)`  для ввода паспортных данных:
- Фамилия;
- Имя;
- Отчество(при наличии);
- Дата рождения;
- Тип документа; 
- Серия и номер документа;
- Дата выдачи документа.<br>
И получения ИНН `(массив items[])`.
  2.1 **Валидация** 
    В строках: "Фамилия", "Имя", "Отчество" происвести валидацию так , чтобы допускалось вводить только символы кириллицы,одиночные             пробелы,дефисы,точки, запятые и круглые скобки 
    В строке "Cерия и номер документа" происвести валидацию так , чтобы допускалось вводить только от 9 до 10 символов


##


3. После успешного ввода паспортных данных клиентом(клиент не должен иметь 1(ban) или 2(deleted), в поле is_banned ) поменять статус пользователя на 2(В очереди)
3. (Backend) Используя хендлер [GET /user](https://github.com/Likoder/Likoder/blob/main/GETuser.md), запросить данные пользователя. Далее проверить его сессию в БД(user).
##
4. (Backend) Запросить данные с сервера ФНС с помощью API(innfl).
##
5. После ответа с ФНС , проверить данные, если все верно, отправить их в базу данных(usersData), с помощью хендлера [POST /user](https://github.com/Likoder/Likoder/blob/main/PostUser.md) . Пользователю изменить статус на 1(Подтвержден), при отсутствии - статус 0(Неподтвержден), в этом случае дать клиенту заполнить данные вновь(не более 3 раз). В ином случае кнопка добавления документа исчезает из ЛК.   

##
7. (Backend) Создать раздел в службе поддержке 
"Удаление паспортных данных", в случае если 
аккаунт имеет статус "не подтверждённый" 
вывести ошибку "Аккаунт не имеет 
подтверждённых паспортных данных! Для 
верификации перейдите в личный кабинет!", в 
случае если аккаунт имеет статус 
"подтверждённый" использовать хендлер 
[DELETE /passP](https://github.com/Likoder/Likoder/blob/main/DeletePasp.md), ручку может использовать только юзер ,в БД(user) ,в поле "is_role" которого стоит 2(admin) , и поле is_banned не 1(ban) или 2(deleted), после удаления вновь 
отображать кнопку "Добавление паспортных данных" пользователю 
в ЛК.
##
#### Визуализация БД

##### БД ФНС

![](https://sun9-74.userapi.com/impg/pJ-iOQ3ZhHCnNJKw_RcJ0rAF8Qjvq4vTlAuUsw/PsGyl38uiMU.jpg?size=208x274&quality=96&sign=ebde538fbe4fca50bf2a8ce1320d06a8&type=album)

##### БД мобильного приложения
![](https://sun9-49.userapi.com/impg/RtJAlvtAdXn1WFHe7cA9-rCH_jsRZOfzE-WBvQ/K59ac87p4SU.jpg?size=225x180&quality=96&sign=68beac00e918f55e4a5f70213e744618&type=album)
##


##

#### [Визуализация процессов при помощи _Sequence diagram_](https://app.diagrams.net/#G1LRt97hgE0UZMJUCE8OFtyhFLSXPlEMP4)
##### Процесс добавления паспортных данных в личный кабинет
![](https://sun9-73.userapi.com/impg/QTDxNMyUDkoAd5QOU8iceOkdR8GKh4_qlslt6w/3fHPNeBNF-I.jpg?size=550x557&quality=96&sign=600275a070431d119e8dcf9bfb18b6f2&type=album)
##### Процесс удаления паспортных данных
![](https://sun21-1.userapi.com/impg/ko7-9IktJjU_DSl62N1LpnLSKUrBk-6ZYIpuPQ/nvcvLXhwBxU.jpg?size=638x571&quality=96&sign=c9b01e39935e7711cd216277bf8236a0&type=album)

*БД - базы данных*

*ЛК - личный кабинет*
